In [1]:
import pandas as pd
import numpy as np

In [2]:
df1 = pd.read_csv('/Users/terrygilmore/Desktop/Divvy_DB/Divvy_Stations_Trips_2013/Divvy_Stations_2013.csv')

In [3]:
df2 = pd.read_csv('/Users/terrygilmore/Desktop/Divvy_DB/Divvy_Stations_Trips_2013/Divvy_Trips_2013.csv')

/var/folders/53/dpbddzdx40ld_nw2zwjgq7dc0000gq/T/ipykernel_1370/2934596855.py:1: DtypeWarning: Columns (10) have mixed types. Specify dtype option on import or set low_memory=False.
  df2 = pd.read_csv('/Users/terrygilmore/Desktop/Divvy_DB/Divvy_Stations_Trips_2013/Divvy_Trips_2013.csv')

In [4]:
df2 = pd.read_csv('/Users/terrygilmore/Desktop/Divvy_DB/Divvy_Stations_Trips_2013/Divvy_Trips_2013.csv', low_memory=False)

In [5]:
df3 = pd.read_csv('/Users/terrygilmore/Desktop/Divvy_DB/Divvy_Stations_Trips_2013/Divvy_Stations_2014-Q3Q4.csv')

In [6]:
df4 = pd.read_excel('/Users/terrygilmore/Desktop/Divvy_DB/Divvy_Stations_Trips_2013/Divvy_Stations_2013-Q1Q2.xlsx')

In [7]:
df1.info(verbose=True)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 300 entries, 0 to 299
Data columns (total 7 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   id           300 non-null    int64
 1   name         300 non-null    object
 2   latitude     300 non-null    float64
 3   longitude    300 non-null    float64
 4   dpcapacity   300 non-null    int64
 5   landmark     300 non-null    int64
 6   online date  300 non-null    object
dtypes: float64(2), int64(3), object(2)
memory usage: 16.5+ KB

In [8]:
df1["online date"] = pd.to_datetime(df1["online date"])

In [9]:
df1.tail()

,id,name,latitude,longitude,dpcapacity,landmark,online date
295,347,Ashland Ave & Grace St,41.950687,-87.668700,15,319,2013-10-12
296,348,California Ave & 21st St,41.854016,-87.695445,15,96,2013-10-14
297,349,Halsted St & Wrightwood Ave,41.929143,-87.649077,15,210,2013-10-28
298,350,Ashland Ave & Chicago Ave,41.895966,-87.667747,15,247,2013-10-22
299,351,Cottage Grove Ave & 51st St,41.803038,-87.606615,15,440,2013-10-17

In [10]:
df3.info(verbose=True)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 300 entries, 0 to 299
Data columns (total 6 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   id           300 non-null    int64
 1   name         300 non-null    object
 2   latitude     300 non-null    float64
 3   longitude    300 non-null    float64
 4   dpcapacity   300 non-null    int64
 5   dateCreated  300 non-null    object
dtypes: float64(2), int64(2), object(2)
memory usage: 14.2+ KB

In [11]:
df3.rename(columns = {'dateCreated':'online date'}, inplace = True)

In [12]:
df3["online date"] = pd.to_datetime(df3["online date"])

In [13]:
df3.tail()

,id,name,latitude,longitude,dpcapacity,online date
295,347,Ashland Ave & Grace St,41.950687,-87.668700,15,2013-10-04 16:06:00
296,348,California Ave & 21st St,41.854016,-87.695445,15,2013-10-09 16:13:00
297,349,Halsted St & Wrightwood Ave,41.929143,-87.649077,15,2013-10-10 12:40:00
298,350,Ashland Ave & Chicago Ave,41.895966,-87.667747,15,2013-10-10 14:22:00
299,351,Cottage Grove Ave & 51st St,41.803038,-87.606615,15,2013-10-10 16:56:00

In [14]:
df4.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 300 entries, 0 to 299
Data columns (total 6 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   id           300 non-null    int64
 1   name         300 non-null    object
 2   latitude     300 non-null    float64
 3   longitude    300 non-null    float64
 4   dpcapacity   300 non-null    int64
 5   online date  300 non-null    datetime64[ns]
dtypes: datetime64[ns](1), float64(2), int64(2), object(1)
memory usage: 14.2+ KB

In [15]:
df4.tail()

,id,name,latitude,longitude,dpcapacity,online date
295,181,LaSalle St & Illinois St,41.890749,-87.632060,31,2013-07-21
296,341,Adler Planetarium,41.866095,-87.607267,19,2013-10-09
297,285,Wood St & Grand Ave,41.891130,-87.672030,15,2013-09-13
298,277,Ashland Ave & Grand Ave,41.891072,-87.666611,15,2013-09-12
299,351,Cottage Grove Ave & 51st St,41.803038,-87.606615,15,2013-10-17

In [16]:
df_2013_2 = pd.concat([df1, df3, df4])

In [17]:
df_2013_2.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 900 entries, 0 to 299
Data columns (total 7 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   id           900 non-null    int64
 1   name         900 non-null    object
 2   latitude     900 non-null    float64
 3   longitude    900 non-null    float64
 4   dpcapacity   900 non-null    int64
 5   landmark     300 non-null    float64
 6   online date  900 non-null    datetime64[ns]
dtypes: datetime64[ns](1), float64(3), int64(2), object(1)
memory usage: 56.2+ KB

In [18]:
df_2013_2['landmark'].fillna(0, inplace=True)

In [19]:
df_2013_2.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 900 entries, 0 to 299
Data columns (total 7 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   id           900 non-null    int64
 1   name         900 non-null    object
 2   latitude     900 non-null    float64
 3   longitude    900 non-null    float64
 4   dpcapacity   900 non-null    int64
 5   landmark     900 non-null    float64
 6   online date  900 non-null    datetime64[ns]
dtypes: datetime64[ns](1), float64(3), int64(2), object(1)
memory usage: 56.2+ KB

In [20]:
duplicate = df_2013_2[df_2013_2.duplicated()]
print(duplicate)

Empty DataFrame
Columns: [id, name, latitude, longitude, dpcapacity, landmark, online date]
Index: []

In [21]:
df2.info(verbose=True)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 759788 entries, 0 to 759787
Data columns (total 12 columns):
 #   Column             Non-Null Count   Dtype
---  ------             --------------   -----
 0   trip_id            759788 non-null  int64
 1   starttime          759788 non-null  object
 2   stoptime           759788 non-null  object
 3   bikeid             759788 non-null  int64
 4   tripduration       759788 non-null  int64
 5   from_station_id    759788 non-null  int64
 6   from_station_name  759788 non-null  object
 7   to_station_id      759788 non-null  int64
 8   to_station_name    759788 non-null  object
 9   usertype           759788 non-null  object
 10  gender             403046 non-null  object
 11  birthday           402909 non-null  float64
dtypes: float64(1), int64(5), object(6)
memory usage: 69.6+ MB

In [22]:
df2.head()

,trip_id,starttime,stoptime,bikeid,tripduration,from_station_id,from_station_name,to_station_id,to_station_name,usertype,gender,birthday
0,4118,2013-06-27 12:11,2013-06-27 12:16,480,316,85,Michigan Ave & Oak St,28,Larrabee St & Menomonee St,Customer,NaN,NaN
1,4275,2013-06-27 14:44,2013-06-27 14:45,77,64,32,Racine Ave & Congress Pkwy,32,Racine Ave & Congress Pkwy,Customer,NaN,NaN
2,4291,2013-06-27 14:58,2013-06-27 15:05,77,433,32,Racine Ave & Congress Pkwy,19,Loomis St & Taylor St,Customer,NaN,NaN
3,4316,2013-06-27 15:06,2013-06-27 15:09,77,123,19,Loomis St & Taylor St,19,Loomis St & Taylor St,Customer,NaN,NaN
4,4342,2013-06-27 15:13,2013-06-27 15:27,77,852,19,Loomis St & Taylor St,55,Halsted St & James M Rochford St,Customer,NaN,NaN

In [23]:
df2.tail()

,trip_id,starttime,stoptime,bikeid,tripduration,from_station_id,from_station_name,to_station_id,to_station_name,usertype,gender,birthday
759783,1109257,2013-12-31 21:12,2013-12-31 21:16,1917,284,20,Sheffield Ave & Kingsbury St,93,Sheffield Ave & Willow St,Subscriber,Female,1983.0
759784,1109276,2013-12-31 21:36,2013-12-31 22:01,2859,1493,227,Southport Ave & Waveland Ave,228,Damen Ave & Melrose Ave,Subscriber,Female,1978.0
759785,1109283,2013-12-31 22:03,2013-12-31 22:13,198,650,284,Michigan Ave & Jackson Blvd,43,Michigan Ave & Washington St,Subscriber,Female,1976.0
759786,1109309,2013-12-31 22:10,2013-12-31 22:16,2048,346,130,Damen Ave & Division St,69,Damen Ave & Pierce Ave,Subscriber,Female,1976.0
759787,1109338,2013-12-31 22:35,2013-12-31 22:49,2239,868,216,California Ave & Division St,69,Damen Ave & Pierce Ave,Subscriber,Female,1978.0

In [24]:
df2.loc[df2['gender'].isnull(), 'gender'] = 'Unknown'
df2.loc[df2['birthday'].isnull(), 'birthday'] = 0

In [25]:
df2.info(verbose=True)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 759788 entries, 0 to 759787
Data columns (total 12 columns):
 #   Column             Non-Null Count   Dtype
---  ------             --------------   -----
 0   trip_id            759788 non-null  int64
 1   starttime          759788 non-null  object
 2   stoptime           759788 non-null  object
 3   bikeid             759788 non-null  int64
 4   tripduration       759788 non-null  int64
 5   from_station_id    759788 non-null  int64
 6   from_station_name  759788 non-null  object
 7   to_station_id      759788 non-null  int64
 8   to_station_name    759788 non-null  object
 9   usertype           759788 non-null  object
 10  gender             759788 non-null  object
 11  birthday           759788 non-null  float64
dtypes: float64(1), int64(5), object(6)
memory usage: 69.6+ MB

In [26]:
df2.head()

,trip_id,starttime,stoptime,bikeid,tripduration,from_station_id,from_station_name,to_station_id,to_station_name,usertype,gender,birthday
0,4118,2013-06-27 12:11,2013-06-27 12:16,480,316,85,Michigan Ave & Oak St,28,Larrabee St & Menomonee St,Customer,Unknown,0.0
1,4275,2013-06-27 14:44,2013-06-27 14:45,77,64,32,Racine Ave & Congress Pkwy,32,Racine Ave & Congress Pkwy,Customer,Unknown,0.0
2,4291,2013-06-27 14:58,2013-06-27 15:05,77,433,32,Racine Ave & Congress Pkwy,19,Loomis St & Taylor St,Customer,Unknown,0.0
3,4316,2013-06-27 15:06,2013-06-27 15:09,77,123,19,Loomis St & Taylor St,19,Loomis St & Taylor St,Customer,Unknown,0.0
4,4342,2013-06-27 15:13,2013-06-27 15:27,77,852,19,Loomis St & Taylor St,55,Halsted St & James M Rochford St,Customer,Unknown,0.0

In [27]:
df2["starttime"] = pd.to_datetime(df2["starttime"])
df2["stoptime"] = pd.to_datetime(df2["stoptime"])

In [28]:
df2.head()

,trip_id,starttime,stoptime,bikeid,tripduration,from_station_id,from_station_name,to_station_id,to_station_name,usertype,gender,birthday
0,4118,2013-06-27 12:11:00,2013-06-27 12:16:00,480,316,85,Michigan Ave & Oak St,28,Larrabee St & Menomonee St,Customer,Unknown,0.0
1,4275,2013-06-27 14:44:00,2013-06-27 14:45:00,77,64,32,Racine Ave & Congress Pkwy,32,Racine Ave & Congress Pkwy,Customer,Unknown,0.0
2,4291,2013-06-27 14:58:00,2013-06-27 15:05:00,77,433,32,Racine Ave & Congress Pkwy,19,Loomis St & Taylor St,Customer,Unknown,0.0
3,4316,2013-06-27 15:06:00,2013-06-27 15:09:00,77,123,19,Loomis St & Taylor St,19,Loomis St & Taylor St,Customer,Unknown,0.0
4,4342,2013-06-27 15:13:00,2013-06-27 15:27:00,77,852,19,Loomis St & Taylor St,55,Halsted St & James M Rochford St,Customer,Unknown,0.0

In [29]:
df2.rename(columns = {'birthday':'birthyear'}, inplace = True)

In [30]:
df2.info(verbose=True)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 759788 entries, 0 to 759787
Data columns (total 12 columns):
 #   Column             Non-Null Count   Dtype
---  ------             --------------   -----
 0   trip_id            759788 non-null  int64
 1   starttime          759788 non-null  datetime64[ns]
 2   stoptime           759788 non-null  datetime64[ns]
 3   bikeid             759788 non-null  int64
 4   tripduration       759788 non-null  int64
 5   from_station_id    759788 non-null  int64
 6   from_station_name  759788 non-null  object
 7   to_station_id      759788 non-null  int64
 8   to_station_name    759788 non-null  object
 9   usertype           759788 non-null  object
 10  gender             759788 non-null  object
 11  birthyear          759788 non-null  float64
dtypes: datetime64[ns](2), float64(1), int64(5), object(4)
memory usage: 69.6+ MB

In [31]:
df2.drop([675324], axis=0, inplace=True)

In [32]:
df_2013_2.to_csv('2013_Sub_Clean.csv', index=False)

In [33]:
df2.to_csv('2013_Clean.csv', index=False)

* Revert from variables back to cleaned CSV.